a = int(input("Вітаю Вас у грі 'Вгадай улюблене число Тома'.Вам потрібно вгадати, яке число від 1 до 50 є улюбленим у Тома."))
i = 0 #Кількість ітерацій цикла
    
while a != 12:
    i = i + 1
    if i > 2:
        print ("На жаль, кількість спроб завершилася! До нових зустрічей!")
        break

    if a > 50:
        print ("Ви ввели занадто велике число!")
        
    print ("Ви ввели неправильне число, спробуйте ще раз!")
    a = int(input("Введіть число від 1 до 50"))

    if a == 12:
        print("Вітаю, Ви вгадали улюблене число Тома!!!")
    
