data_ = [
            ['Універсам 22', 'Будівлі', '44 048,00', '500,00', '200,00'],
            ['Дніпрянка   ', 'Будівлі', '22 456,00', '365,00', '123,00'], 
            ['Універсам 22', 'Машини та обладнання', '5 564,00', '2 571,00', '135,00'],
            ['Дніпрянка   ', 'Машини та обладнання', '10 087,00', '15972,00', '58,00'],
            ['Універсам 22', 'Транспортні засоби', '0,00', '0,00', '0,00'],
            ['Дніпрянка   ', 'Транспортні засоби', '206,00', '34,00', '50,00'],
            ['Універсам 22', 'Інструмент та інвертар', '116,00', '64,00', '23,00'], 
            ['Дніпрянка   ', 'Інструмент та інвертар', '34,00', '23,00', '25,00']
]