from prettytable import PrettyTable  # Імпортуємо встановлений у командній строці модуль.

# Записуємо шапку та дані таблиці.
th = ['Підприємство', 'Код виду основних засобів', 'Залишок на 1.01.2018', 'Надійшло у 2018', 'Вибуток у 2018']
td = ['Універсам 22', '1', '44 048,00', '500,00', '200,00',
      'Дніпрянка   ', '1', '22 456,00', '365,00', '123,00', 
      'Універсам 22', '2', '5 564,00', '2 571,00', '135,00',
      'Дніпрянка   ', '2', '10 087,00', '15972,00', '58,00',
      'Універсам 22', '3', '0,00', '0,00', '0,00',
      'Дніпрянка   ', '3', '206,00', '34,00', '50,00',
      'Універсам 22', '4', '116,00', '64,00', '23,00', 
      'Дніпрянка   ', '4', '34,00', '23,00', '25,00',]

columns = len(th)  # Підраховуємо кількість стовпців у нашій таблиці.
table = PrettyTable(th)  # Определяем таблицу.

td_data = td[:]# Cкопіюємо список td

while td_data: #Цикл, який заповнює таблицю
    table.add_row(td_data[:columns])
    td_data = td_data[columns:]

print(table)  # Виводимо таблицу