from prettytable import PrettyTable  # Імпортуємо встановлений у командній строці модуль.

# Записуємо шапку та дані таблиці.
th = ['Код виду основних засобів', 'Вид основних засобів']
td = ['1', 'Будівлі',
      '2', 'Машини та обладнання',
      '3', 'Транспортні засоби',
      '4', 'Інструмент та інвертар',]

columns = len(th)  # Підраховуємо кількість стовпців у нашій таблиці.
table = PrettyTable(th)  # Определяем таблицу.

td_data = td[:]# Cкопіюємо список td

while td_data: #Цикл, який заповнює таблицю
    table.add_row(td_data[:columns])
    td_data = td_data[columns:]

print(table)  # Виводимо таблицу